; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/transport/domain.pddl
; updates:
;  - removed :action-costs and :functions
;  - capacity type now is size
;  - capacity-number predicate now is capacity
(define (domain transport)
  (:requirements :typing)
  (:types
        size location locatable - object
        vehicle package - locatable
  )

  (:predicates
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - size)
     (capacity-predecessor ?s1 ?s2 - size)
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - size)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
      )
  )

)

; problem
;; vehicles=6, packages=15, locations=15, max_capacity=2, out_folder=training/easy, instance_id=88, seed=129

(define (problem transport-88)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity v5 c2)
    (capacity v6 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l2)
    (at p2 l12)
    (at p3 l9)
    (at p4 l3)
    (at p5 l3)
    (at p6 l11)
    (at p7 l13)
    (at p8 l5)
    (at p9 l10)
    (at p10 l4)
    (at p11 l13)
    (at p12 l3)
    (at p13 l8)
    (at p14 l12)
    (at p15 l10)
    (at v1 l13)
    (at v2 l8)
    (at v3 l3)
    (at v4 l2)
    (at v5 l5)
    (at v6 l2)
    (road l6 l15)
    (road l4 l9)
    (road l3 l10)
    (road l5 l1)
    (road l10 l6)
    (road l10 l3)
    (road l10 l9)
    (road l8 l12)
    (road l11 l8)
    (road l2 l8)
    (road l7 l1)
    (road l6 l14)
    (road l14 l6)
    (road l8 l2)
    (road l8 l11)
    (road l9 l4)
    (road l9 l10)
    (road l13 l4)
    (road l10 l8)
    (road l1 l5)
    (road l6 l10)
    (road l12 l8)
    (road l4 l13)
    (road l8 l10)
    (road l10 l1)
    (road l1 l7)
    (road l15 l6)
    (road l1 l10)
    (road l6 l12)
    (road l12 l6)
    (road l2 l10)
    (road l10 l2)
    (road l9 l12)
    (road l12 l9)
    (road l10 l13)
    (road l13 l10)
    (road l1 l8)
    (road l8 l1)
    (road l8 l9)
    (road l9 l8)
    (road l1 l12)
    (road l12 l1)
    (road l1 l9)
    (road l9 l1)
    (road l11 l13)
    (road l13 l11)
    (road l11 l15)
    (road l15 l11)
    (road l5 l11)
    (road l11 l5)
    (road l4 l6)
    (road l6 l4)
    (road l10 l14)
    (road l14 l10)
    (road l4 l10)
    (road l10 l4)
    (road l9 l11)
    (road l11 l9)
    (road l7 l10)
    (road l10 l7)
    (road l1 l13)
    (road l13 l1)
    (road l5 l14)
    (road l14 l5)
    (road l4 l15)
    (road l15 l4)
    (road l5 l7)
    (road l7 l5)
    (road l4 l8)
    (road l8 l4)
    (road l2 l7)
    (road l7 l2)
    (road l5 l10)
    (road l10 l5)
    )
 (:goal  (and 
    (at p1 l4)
    (at p2 l11)
    (at p3 l8)
    (at p4 l6)
    (at p5 l5)
    (at p6 l15)
    (at p7 l9)
    (at p8 l11)
    (at p9 l9)
    (at p10 l10)
    (at p11 l9)
    (at p12 l11)
    (at p13 l9)
    (at p14 l1)
    (at p15 l6))))

; plan
1. (drive v1 l13 l10)
   deleted: (at v1 l13)
   added: (at v1 l10)
   goals met: 0 of 15
2. (drive v1 l10 l2)
   deleted: (at v1 l10)
   added: (at v1 l2)
   goals met: 0 of 15
3. (pick-up v1 l2 p1 c1 c2)
   deleted: (at p1 l2) (capacity v1 c2)
   added: (in p1 v1) (capacity v1 c1)
   goals met: 0 of 15
4. (drive v1 l2 l8)
   deleted: (at v1 l2)
   added: (at v1 l8)
   goals met: 0 of 15
5. (drive v1 l8 l4)
   deleted: (at v1 l8)
   added: (at v1 l4)
   goals met: 0 of 15
6. (drop v1 l4 p1 c1 c2)
   deleted: (in p1 v1) (capacity v1 c1)
   added: (at p1 l4) (capacity v1 c2)
   goals met: 1 of 15
7. (drive v1 l4 l9)
   deleted: (at v1 l4)
   added: (at v1 l9)
   goals met: 1 of 15
8. (drive v1 l9 l12)
   deleted: (at v1 l9)
   added: (at v1 l12)
   goals met: 1 of 15
9. (pick-up v1 l12 p2 c1 c2)
   deleted: (at p2 l12) (capacity v1 c2)
   added: (in p2 v1) (capacity v1 c1)
   goals met: 1 of 15
10. (drive v1 l12 l8)
   deleted: (at v1 l12)
   added: (at v1 l8)
   goals met: 1 of 15
11. (drive v1 l8 l11)
   deleted: (at v1 l8)
   added: (at v1 l11)
   goals met: 1 of 15
12. (drop v1 l11 p2 c1 c2)
   deleted: (in p2 v1) (capacity v1 c1)
   added: (at p2 l11) (capacity v1 c2)
   goals met: 2 of 15
13. (drive v1 l11 l9)
   deleted: (at v1 l11)
   added: (at v1 l9)
   goals met: 2 of 15
14. (pick-up v1 l9 p3 c1 c2)
   deleted: (at p3 l9) (capacity v1 c2)
   added: (in p3 v1) (capacity v1 c1)
   goals met: 2 of 15
15. (drive v1 l9 l8)
   deleted: (at v1 l9)
   added: (at v1 l8)
   goals met: 2 of 15
16. (drop v1 l8 p3 c1 c2)
   deleted: (in p3 v1) (capacity v1 c1)
   added: (at p3 l8) (capacity v1 c2)
   goals met: 3 of 15
17. (drive v1 l8 l10)
   deleted: (at v1 l8)
   added: (at v1 l10)
   goals met: 3 of 15
18. (drive v1 l10 l3)
   deleted: (at v1 l10)
   added: (at v1 l3)
   goals met: 3 of 15
19. (pick-up v1 l3 p4 c1 c2)
   deleted: (at p4 l3) (capacity v1 c2)
   added: (in p4 v1) (capacity v1 c1)
   goals met: 3 of 15
20. (drive v1 l3 l10)
   deleted: (at v1 l3)
   added: (at v1 l10)
   goals met: 3 of 15
21. (drive v1 l10 l6)
   deleted: (at v1 l10)
   added: (at v1 l6)
   goals met: 3 of 15
22. (drop v1 l6 p4 c1 c2)
   deleted: (in p4 v1) (capacity v1 c1)
   added: (at p4 l6) (capacity v1 c2)
   goals met: 4 of 15
23. (drive v1 l6 l10)
   deleted: (at v1 l6)
   added: (at v1 l10)
   goals met: 4 of 15
24. (drive v1 l10 l3)
   deleted: (at v1 l10)
   added: (at v1 l3)
   goals met: 4 of 15
25. (pick-up v1 l3 p5 c1 c2)
   deleted: (at p5 l3) (capacity v1 c2)
   added: (in p5 v1) (capacity v1 c1)
   goals met: 4 of 15
26. (drive v1 l3 l10)
   deleted: (at v1 l3)
   added: (at v1 l10)
   goals met: 4 of 15
27. (drive v1 l10 l5)
   deleted: (at v1 l10)
   added: (at v1 l5)
   goals met: 4 of 15
28. (drop v1 l5 p5 c1 c2)
   deleted: (in p5 v1) (capacity v1 c1)
   added: (at p5 l5) (capacity v1 c2)
   goals met: 5 of 15
29. (drive v1 l5 l11)
   deleted: (at v1 l5)
   added: (at v1 l11)
   goals met: 5 of 15
30. (pick-up v1 l11 p6 c1 c2)
   deleted: (at p6 l11) (capacity v1 c2)
   added: (in p6 v1) (capacity v1 c1)
   goals met: 5 of 15
31. (drive v1 l11 l15)
   deleted: (at v1 l11)
   added: (at v1 l15)
   goals met: 5 of 15
32. (drop v1 l15 p6 c1 c2)
   deleted: (in p6 v1) (capacity v1 c1)
   added: (at p6 l15) (capacity v1 c2)
   goals met: 6 of 15
33. (drive v1 l15 l11)
   deleted: (at v1 l15)
   added: (at v1 l11)
   goals met: 6 of 15
34. (drive v1 l11 l13)
   deleted: (at v1 l11)
   added: (at v1 l13)
   goals met: 6 of 15
35. (pick-up v1 l13 p7 c1 c2)
   deleted: (at p7 l13) (capacity v1 c2)
   added: (in p7 v1) (capacity v1 c1)
   goals met: 6 of 15
36. (drive v1 l13 l4)
   deleted: (at v1 l13)
   added: (at v1 l4)
   goals met: 6 of 15
37. (drive v1 l4 l9)
   deleted: (at v1 l4)
   added: (at v1 l9)
   goals met: 6 of 15
38. (drop v1 l9 p7 c1 c2)
   deleted: (in p7 v1) (capacity v1 c1)
   added: (at p7 l9) (capacity v1 c2)
   goals met: 7 of 15
39. (drive v1 l9 l10)
   deleted: (at v1 l9)
   added: (at v1 l10)
   goals met: 7 of 15
40. (drive v1 l10 l5)
   deleted: (at v1 l10)
   added: (at v1 l5)
   goals met: 7 of 15
41. (pick-up v1 l5 p8 c1 c2)
   deleted: (at p8 l5) (capacity v1 c2)
   added: (in p8 v1) (capacity v1 c1)
   goals met: 7 of 15
42. (drive v1 l5 l11)
   deleted: (at v1 l5)
   added: (at v1 l11)
   goals met: 7 of 15
43. (drop v1 l11 p8 c1 c2)
   deleted: (in p8 v1) (capacity v1 c1)
   added: (at p8 l11) (capacity v1 c2)
   goals met: 8 of 15
44. (drive v1 l11 l8)
   deleted: (at v1 l11)
   added: (at v1 l8)
   goals met: 8 of 15
45. (drive v1 l8 l10)
   deleted: (at v1 l8)
   added: (at v1 l10)
   goals met: 8 of 15
46. (pick-up v1 l10 p9 c1 c2)
   deleted: (at p9 l10) (capacity v1 c2)
   added: (in p9 v1) (capacity v1 c1)
   goals met: 8 of 15
47. (drive v1 l10 l9)
   deleted: (at v1 l10)
   added: (at v1 l9)
   goals met: 8 of 15
48. (drop v1 l9 p9 c1 c2)
   deleted: (in p9 v1) (capacity v1 c1)
   added: (at p9 l9) (capacity v1 c2)
   goals met: 9 of 15
49. (drive v1 l9 l4)
   deleted: (at v1 l9)
   added: (at v1 l4)
   goals met: 9 of 15
50. (pick-up v1 l4 p10 c1 c2)
   deleted: (at p10 l4) (capacity v1 c2)
   added: (in p10 v1) (capacity v1 c1)
   goals met: 9 of 15
51. (drive v1 l4 l10)
   deleted: (at v1 l4)
   added: (at v1 l10)
   goals met: 9 of 15
52. (drop v1 l10 p10 c1 c2)
   deleted: (in p10 v1) (capacity v1 c1)
   added: (at p10 l10) (capacity v1 c2)
   goals met: 10 of 15
53. (drive v1 l10 l13)
   deleted: (at v1 l10)
   added: (at v1 l13)
   goals met: 10 of 15
54. (pick-up v1 l13 p11 c1 c2)
   deleted: (at p11 l13) (capacity v1 c2)
   added: (in p11 v1) (capacity v1 c1)
   goals met: 10 of 15
55. (drive v1 l13 l4)
   deleted: (at v1 l13)
   added: (at v1 l4)
   goals met: 10 of 15
56. (drive v1 l4 l9)
   deleted: (at v1 l4)
   added: (at v1 l9)
   goals met: 10 of 15
57. (drop v1 l9 p11 c1 c2)
   deleted: (in p11 v1) (capacity v1 c1)
   added: (at p11 l9) (capacity v1 c2)
   goals met: 11 of 15
58. (drive v1 l9 l10)
   deleted: (at v1 l9)
   added: (at v1 l10)
   goals met: 11 of 15
59. (drive v1 l10 l3)
   deleted: (at v1 l10)
   added: (at v1 l3)
   goals met: 11 of 15
60. (pick-up v1 l3 p12 c1 c2)
   deleted: (at p12 l3) (capacity v1 c2)
   added: (in p12 v1) (capacity v1 c1)
   goals met: 11 of 15
61. (drive v1 l3 l10)
   deleted: (at v1 l3)
   added: (at v1 l10)
   goals met: 11 of 15
62. (drive v1 l10 l9)
   deleted: (at v1 l10)
   added: (at v1 l9)
   goals met: 11 of 15
63. (drive v1 l9 l11)
   deleted: (at v1 l9)
   added: (at v1 l11)
   goals met: 11 of 15
64. (drop v1 l11 p12 c1 c2)
   deleted: (in p12 v1) (capacity v1 c1)
   added: (at p12 l11) (capacity v1 c2)
   goals met: 12 of 15
65. (drive v1 l11 l8)
   deleted: (at v1 l11)
   added: (at v1 l8)
   goals met: 12 of 15
66. (pick-up v1 l8 p13 c1 c2)
   deleted: (at p13 l8) (capacity v1 c2)
   added: (in p13 v1) (capacity v1 c1)
   goals met: 12 of 15
67. (drive v1 l8 l9)
   deleted: (at v1 l8)
   added: (at v1 l9)
   goals met: 12 of 15
68. (drop v1 l9 p13 c1 c2)
   deleted: (in p13 v1) (capacity v1 c1)
   added: (at p13 l9) (capacity v1 c2)
   goals met: 13 of 15
69. (drive v1 l9 l12)
   deleted: (at v1 l9)
   added: (at v1 l12)
   goals met: 13 of 15
70. (pick-up v1 l12 p14 c1 c2)
   deleted: (at p14 l12) (capacity v1 c2)
   added: (in p14 v1) (capacity v1 c1)
   goals met: 13 of 15
71. (drive v1 l12 l1)
   deleted: (at v1 l12)
   added: (at v1 l1)
   goals met: 13 of 15
72. (drop v1 l1 p14 c1 c2)
   deleted: (in p14 v1) (capacity v1 c1)
   added: (at p14 l1) (capacity v1 c2)
   goals met: 14 of 15
73. (drive v1 l1 l10)
   deleted: (at v1 l1)
   added: (at v1 l10)
   goals met: 14 of 15
74. (pick-up v1 l10 p15 c1 c2)
   deleted: (at p15 l10) (capacity v1 c2)
   added: (in p15 v1) (capacity v1 c1)
   goals met: 14 of 15
75. (drive v1 l10 l6)
   deleted: (at v1 l10)
   added: (at v1 l6)
   goals met: 14 of 15
76. (drop v1 l6 p15 c1 c2)
   deleted: (in p15 v1) (capacity v1 c1)
   added: (at p15 l6) (capacity v1 c2)
   goals met: 15 of 15
